Checkout my blog on medium.com @

In [0]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt
%matplotlib inline

In [0]:
sample = pd.DataFrame([[1000],[2000],[3000],[4000],[5000],[6000],[7000],[8000],[9000],[20000]] 
                      , columns=['Salary'])

In [3]:
sample

   Salary
0    1000
1    2000
2    3000
3    4000
4    5000
5    6000
6    7000
7    8000
8    9000
9   20000

In [0]:
def outlier_treatment(datacolumn):
    sorted(datacolumn)
    Q1,Q3 = np.percentile(datacolumn , [25,75])
    IQR = Q3 - Q1
    lower_range = Q1 - (1.5 * IQR)
    upper_range = Q3 + (1.5 * IQR)
    return lower_range,upper_range

In [0]:
l,u = outlier_treatment(sample.Salary)

In [6]:
l

-3500.0

In [7]:
u

14500.0

In [28]:
sample[ (sample.Salary > u) | (sample.Salary < l) ]

   Salary
9   20000

In [0]:
sample.drop(sample[ (sample.Salary > u) | (sample.Salary < l) ].index , inplace=True)

In [25]:
sample

   Salary
0    1000
1    2000
2    3000
3    4000
4    5000
5    6000
6    7000
7    8000
8    9000